app/controllers/welcome_controller.rb

  def index
  	@golfs = Golf.all
---
SELECT "golfs".* FROM "golfs"

  def create
  	Golf.create!(params.require(:golf).permit(:name, :description, :url, :country))
---
INSERT INTO "golfs" ("name", "description", "url", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "wefwe"], ["description", "wefwe"], ["url", "http://www.golf.com"], ["country", "wefwe"], ["created_at", "2016-10-30 21:42:18.401169"], ["updated_at", "2016-10-30 21:42:18.401169"]]